{
    "jobs": [
        {
            "title": "MacOS Developer",
            "company": "BlueJeans by Verizon",
            "startDate": "2022-03-01",
            "endDate": "2023-12-29",
            "location": "San Jose, CA",
            "accomplishments": [
                "Led the end-to-end development of new MacOS features, which included gathering requirements from product owners, refining stories for feature epics, spring allocation for the release, hands-on feature implementation, and post-release bug triage and maintenance.",
                "Added robust unit tests with every code change by mocking dependent classes (from AppKit and other managers within the project) and stubbing asynchronous timers and API requests, achieving line coverage of over 95% across all new business logic components.",
                "Owned the development of the MacOS presence feature that published availability and social status messages using the PubNub Swift SDK; this consisted of maintaining the PubNub SDK life cycle, managing the subscription of 400+ user presence channels, and ensuring message payloads worked seamlessly across other platforms (Windows, Android, and iOS)."
            ]
        },
        {
            "title": "iOS Developer",
            "company": "Verizon Connect",
            "startDate": "2021-06-01",
            "endDate": "2022-03-01",
            "location": "Alpharetta, GA",
            "accomplishments": [
                "Collaborated in implementing an iOS Wi-Fi hotspot feature for the Hum device (a connected car system), allowing customers to activate a vehicle's hotspot by simply clicking a button within the mobile application.",
                "Followed the VIPER (View, Interactor, Presenter, Entity, and Router) design pattern to build new features and facilitate the codebase's testing, readability, and maintainability."
            ]
        },
        {
            "title": "iOS Software Engineer Intern",
            "company": "Verizon Connect",
            "startDate": "2020-06-15",
            "endDate": "2020-08-14",
            "location": "Alpharetta, GA",
            "accomplishments": [
                "Designed and implemented an iOS framework of reusable components to reduce the development cycle time,optimize app performance, and enforce consistency across the screens.",
                "Developed a demo iOS application to demonstrate how the components can be easily used and integrated into any project."
            ]
        },
        {
            "title": "Learning Assistant",
            "company": "Bright Success Center",
            "startDate": "2018-01-20",
            "endDate": "2020-05-14",
            "location": "Merced, GA",
            "accomplishments": [
                "Responsible for helping students to understand introductory programming concepts, including, but not limited, to for loops, while loops, and arrays.",
                "Responsible for helping students with basic data structures (stacks, queue, etc.) and algorithms (binary search, insertion sort, etc.)"
            ]
        }
    ]
}
